In [1]:
data = {"first": "srikanth rahul dhaval harshil naman sahith".split(),
        "last": "veeramalla thripati gajjar jogi raswanth konka".split(),
        "age": [25,27,32,22,24,26]}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(data)

In [4]:
df

      first        last  age
0  srikanth  veeramalla   25
1     rahul    thripati   27
2    dhaval      gajjar   32
3   harshil        jogi   22
4     naman    raswanth   24
5    sahith       konka   26

In [5]:
datadf = pd.read_csv('/Users/srikanth/Desktop/data/survey_results_public.csv',index_col="ResponseId")

In [8]:
df.columns = "First_name, Last_name, Age".split(", ")

In [9]:
df

  First_name   Last_name  Age
0   srikanth  veeramalla   25
1      rahul    thripati   27
2     dhaval      gajjar   32
3    harshil        jogi   22
4      naman    raswanth   24
5     sahith       konka   26

In [12]:
df.columns = df.columns.str.replace("_"," ")

In [13]:
df

  First name   Last name  Age
0   srikanth  veeramalla   25
1      rahul    thripati   27
2     dhaval      gajjar   32
3    harshil        jogi   22
4      naman    raswanth   24
5     sahith       konka   26

In [14]:
df.rename(columns= {"First name" :"first",	"Last name" : "last"},inplace=True)

In [41]:
df

      first        last  Age
0  SRIKANTH  veeramalla   25
1     rahul    thripati   27
2    dhaval      gajjar   32
3   harshil        jogi   22
4     naman    raswanth   24
5    SAHITH       konka   26

In [47]:
filt = df["first"].str.startswith("sri")
df.loc[filt,"first"] = ["srikanth","Sahith"]

In [45]:
df[filt]["first"] = "SRI"

/var/folders/q0/wwr3y1sd0d96hkxhv5x1v56w0000gn/T/ipykernel_2485/2661478387.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]["first"] = "SRI"

In [48]:
df

      first        last  Age
0  srikanth  veeramalla   25
1     rahul    thripati   27
2    dhaval      gajjar   32
3   harshil        jogi   22
4     naman    raswanth   24
5    Sahith       konka   26

In [ ]:
df.loc[:,"last"] = df.loc[:,"last"].str.capitalize()

In [56]:
df.loc[:,"first"] = df.loc[:,"first"].str.capitalize()

In [57]:
df

      first        last  Age
0  Srikanth  Veeramalla   25
1     Rahul    Thripati   27
2    Dhaval      Gajjar   32
3   Harshil        Jogi   22
4     Naman    Raswanth   24
5    Sahith       Konka   26

In [59]:
filt = (df["first"]=="Harshil")
df.loc[filt,"Age"] = 24

In [60]:
df

      first        last  Age
0  Srikanth  Veeramalla   25
1     Rahul    Thripati   27
2    Dhaval      Gajjar   32
3   Harshil        Jogi   24
4     Naman    Raswanth   24
5    Sahith       Konka   26